areiter128/pstpl-p33c-tdal/p33c_pral/exth/p33c_port-d.h
    /** 
     * @brief   Device Port Change Notification Interrupt Flag Register (emulated)
     */
    struct CNFx_s {
      uint16_t CNFx0:1;     // Bit 0:  Device Port Change Notification Interrupt Flag Register bit 
      uint16_t CNFx1:1;     // Bit 1:  Device Port Change Notification Interrupt Flag Register bit 
      uint16_t CNFx2:1;     // Bit 2:  Device Port Change Notification Interrupt Flag Register bit 
      uint16_t CNFx3:1;     // Bit 3:  Device Port Change Notification Interrupt Flag Register bit 
      uint16_t CNFx4:1;     // Bit 4:  Device Port Change Notification Interrupt Flag Register bit 
      uint16_t CNFx5:1;     // Bit 5:  Device Port Change Notification Interrupt Flag Register bit 
      uint16_t CNFx6:1;     // Bit 6:  Device Port Change Notification Interrupt Flag Register bit 
      uint16_t CNFx7:1;     // Bit 7:  Device Port Change Notification Interrupt Flag Register bit 
      uint16_t CNFx8:1;     // Bit 8:  Device Port Change Notification Interrupt Flag Register bit 
      uint16_t CNFx9:1;     // Bit 9:  Device Port Change Notification Interrupt Flag Register bit 
      uint16_t CNFx10:1;    // Bit 10: Device Port Change Notification Interrupt Flag Register bit 
      uint16_t CNFx11:1;    // Bit 11: Device Port Change Notification Interrupt Flag Register bit 
      uint16_t CNFx12:1;    // Bit 12: Device Port Change Notification Interrupt Flag Register bit 
      uint16_t CNFx13:1;    // Bit 13: Device Port Change Notification Interrupt Flag Register bit 
      uint16_t CNFx14:1;    // Bit 14: Device Port Change Notification Interrupt Flag Register bit 
      uint16_t CNFx15:1;    // Bit 15: Device Port Change Notification Interrupt Flag Register bit 
    }__attribute__((packed)); // CNFx: CHANGE NOTIFICATION INTERRUPT FLAG FOR PORTx REGISTER
    union CNFx_u {   
        volatile struct CNFx_s bits; // Register bit-field
        volatile uint16_t value; // 16-bit wide register value
    }__attribute__((packed)); // CNFx: CHANGE NOTIFICATION INTERRUPT FLAG FOR PORTx REGISTER

    /** @} */ // end of inheritance declarations **************************************

    typedef union ANSELx_u ANSELx_t; // ANSELx: ANALOG SELECT FOR PORTx REGISTER data type
    typedef union TRISx_u TRISx_t; //TRISx: OUTPUT ENABLE FOR PORTx REGISTER DATA TYPE
    typedef union PORTx_u PORTx_t; // PORTx: INPUT DATA FOR PORTx REGISTER DATA TYPE
    typedef union LATx_u LATx_t; // LATx: OUTPUT PORT LATCH DATA FOR PORTx REGISTER DATA TYPE
    typedef union ODCx_u ODCx_t; // ODCx: OPEN-DRAIN ENABLE FOR PORTx REGISTER DATA TYPE
    typedef union CNPUx_u  CNPUx_t; // CNPUx: CHANGE NOTIFICATION PULL-UP ENABLE FOR PORTx REGISTER DATA TYPE
    typedef union CNPDx_u CNPDx_t; // CNPDx: CHANGE NOTIFICATION PULL-DOWN ENABLE FOR PORTx REGISTER DATA TYPE
    typedef union CNCONx_u  CNCONx_t; // CNCONx: CHANGE NOTIFICATION CONTROL FOR PORTx REGISTER DATA TYPE
    typedef union CNEN0x_u CNEN0x_t; // CNEN0x: CHANGE NOTIFICATION INTERRUPT ENABLE FOR PORTx REGISTER DATA TYPE
    typedef union CNSTATx_u CNSTATx_t; // CNSTATx: CHANGE NOTIFICATION STATUS FOR PORTx REGISTER DATA TYPE
    typedef union CNEN1x_u CNCEN1x_t; // CNEN1x: CHANGE NOTIFICATION EDGE SELECT FOR PORTx REGISTER DATA TYPE
    typedef union CNFx_u CNFx_t; // CNFx: CHANGE NOTIFICATION INTERRUPT FLAG FOR PORTx REGISTER DATA TYPE
    
    /***********************************************************************************
    * @struct   P33C_PORT_INSTANCE_s
    * @ingroup  p33c-pral-port-properties
    * @brief    Abstracted set of Special Function Registers of a GPIO Port instance
    * @details
    *  This structure defines an abstracted set of Special Function Registers of a 
    *  General Purpose Input/Output port instance. Users can use this abstracted
    *  set of registers to capture register settings from or write generic register 
    *  settings to a specific instance of this port.
    **********************************************************************************/
    
    struct P33C_PORT_INSTANCE_s {
        
        ANSELx_t  ANSELx;   ///< ANSELx: ANALOG SELECT FOR PORTx REGISTER DATA TYPE
        TRISx_t   TRISx;    ///< TRISx: OUTPUT ENABLE FOR PORTx REGISTER
        PORTx_t   PORTx;    ///< PORTx: INPUT DATA FOR PORTx REGISTER
        LATx_t    LATx;     ///< LATx: OUTPUT DATA FOR PORTx REGISTER
        ODCx_t    ODCx;     ///< ODCx: OPEN-DRAIN ENABLE FOR PORTx REGISTER
        CNPUx_t   CNPUx;    ///< CNPUx: CHANGE NOTIFICATION PULL-UP ENABLE FOR PORTx REGISTER
        CNPDx_t   CNPDx;    ///< CNPDx: CHANGE NOTIFICATION PULL-DOWN ENABLE FOR PORTx REGISTER
        CNCONx_t  CNCONx;   ///< CNCONx: CHANGE NOTIFICATION CONTROL FOR PORTx REGISTER
        CNEN0x_t  CNEN0x;   ///< CNEN0x: CHANGE NOTIFICATION INTERRUPT ENABLE FOR PORTx REGISTER
        CNSTATx_t CNSTATx;  ///< CNSTATx: CHANGE NOTIFICATION STATUS FOR PORTx REGISTER
        CNCEN1x_t CNEN1x;   ///< CNEN1x: CHANGE NOTIFICATION EDGE SELECT FOR PORTx REGISTER
        CNFx_t    CNFx;     ///< CNFx: CHANGE NOTIFICATION INTERRUPT FLAG FOR PORTx REGISTER

    }; ///< DEVICE PORT REGISTER SET
	typedef struct P33C_PORT_INSTANCE_s P33C_PORT_INSTANCE_t; ///< DEVICE PORT REGISTER SET data type

    /*********************************************************************************
     * @ingroup p33c-pral-port-methods
     * @brief   Gets pointer to Device Port Instance SFR set
     * @param   pInstance: Index of the selected Device Port Instance (0=Port A, 1=Port B, 2=Port C, etc.)
     * @return  Pointer to device port instance object of type P33C_PORT_INSTANCE_t of the selected device port instance
     *  
     * @details
     *  This function returns the pointer to a peripheral instance register set
     *  in Special Function Register memory space. This pointer can be used to 
     *  directly write to/read from the Special Function Registers of the 
     *  peripheral instance configuration.
     * 
     * @note
     *  To maximize code execution performance, the declared peripheral instance 
     *  index parameter is not validated. Hence, GetHandle could potentially return
     *  an invalid memory address with unclear consequences for the user firmware.
     *  Please use @ref p33c_PortInstance_Exists to validate the given peripheral 
     *  instance parameter before using the the returned memory address.
     * 
     * @see
     *  p33c_PortInstance_Exists
     * 
     *********************************************************************************/
	#define p33c_PortInstance_GetHandle(pInstance) (P33C_PORT_INSTANCE_t*)p33c_PortInstance_Handles[(uint16_t)(pInstance)]
    
    /*********************************************************************************
     * @ingroup p33c-pral-port-methods
     * @brief   Checks if the peripheral instance specified by pInstance exists or not
     * @param   pInstance: Index of the peripheral instance of type unsigned integer
     * @return  true:  requested peripheral instance index does exist 
     * @return  false: requested peripheral instance index does not exist 
     *  
     * @details
     *  This function provides a guarding condition test to verify if a specific 
     *  peripheral instance exists before accessing it. 
     *********************************************************************************/
    #define p33c_PortInstance_Exists(pInstance) (bool)(((0 <= pInstance) && (pInstance < p33c_PortInstances)) ? true : false)

#endif /* End of P33C_PORT_INSTANCE_s */
#endif /* End of P33C_PORT_SFR_DECLARATIONS_H */

// ______________________________
// end of file
